Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/storage/meterdata/storage.c
/***********************************************************************************************************************
* File Name    : storage.c
* Version      : 1.00
* Device(s)    : RL78/I1C
* Tool-Chain   : CCRL
* H/W Platform : RL78/I1C Energy Meter Platform
* Description  : Storage Source File
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
// Driver  
#include "r_cg_macrodriver.h"       // CG Macro Driver  
#include "r_cg_rtc.h"           // CG RTC Driver  
#include "r_cg_wdt.h"           // CG WDT Driver  
#include "r_cg_crc.h"           // CG CRC Driver  
#include "r_cg_dsadc.h"         // CG ADC Driver  

// Library  
#include <string.h>             // Compiler standard library  

// MW  
#include "em_core.h"            // EM Core  
#include "eeprom.h"         // EEPROM MW (Init/Read/Write)  
#include "e2rom.h"         // pravak implementation

// WRP  
#include "wrp_em_adc.h"

// Application  
#include "format.h"         // EEPROM Format Header  
#include "storage.h"            // Storage Header File  
#include "event.h"
#ifdef __DEBUG
#include "debug.h"          // Debug header  
#endif

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/
// Storage Module State  
typedef enum tagStorageState
{
    STORAGE_STATE_UNINITIALIZED = 0,        // Uninitialized  
    STORAGE_STATE_INITIALIZED               // Initialized  
    
} STORAGE_STATE;

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/

                                            // "SPEM" ASCII code  
                                            // "53,50,45,4D" ASCII code  
#define STORAGE_EEPROM_HEADER_CODE_MASK     0x5350454D  // Storage Header Code Mask  

                                            // "HEHE" ASCII code  
                                            // "48,45,48,45" ASCII code  
#define STORAGE_EEPROM_HEADER_CODE_TEST     0x48454845  // Storage Header Code Test  

/***********************************************************************************************************************
Imported global variables and functions (from other files)
***********************************************************************************************************************/

/***********************************************************************************************************************
Exported global variables and functions (to be accessed by other files)
***********************************************************************************************************************/

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
// Variables  
#ifndef __DEBUG
static
#endif
STORAGE_EEPROM_HEADER   g_storage_header;                               // Storage Header  

#ifndef __DEBUG
static
#endif
STORAGE_STATE           g_storage_state = STORAGE_STATE_UNINITIALIZED;  // Storage State  

#ifndef __DEBUG
static
#endif
uint8_t                 g_storage_interval_flag;                        // Storage CRC  

// Sub-functions (internal used for module)  
static uint8_t STORAGE_ReadEEPROMHeader(void);          // Read EEPROM Header to g_storage_header  
static uint8_t STORAGE_UpdateEEPROMHeader(void);        // Update g_storage_header to EEPROM Header  

/***********************************************************************************************************************
* Function Name    : static uint8_t STORAGE_ReadEEPROMHeader(void)
* Description      : Read & Check EEPROM Header, store to g_storage_header
* Arguments        : None
* Functions Called : EPR_Read()
* Return Value     : Execution Status
*                  :    STORAGE_OK              Normal end, EEPROM is formatted
*                  :    STORAGE_ERROR           EEPROM Header error
*                  :    STORAGE_NOT_FORMATTED   Storage device is not formatted
***********************************************************************************************************************/
static uint8_t STORAGE_ReadEEPROMHeader(void)
{
    // Read EEPROM header OK?  
    if (EPR_Read(   STORAGE_EEPROM_HEADER_ADDR,
                    (uint8_t *)&g_storage_header,
                    STORAGE_EEPROM_HEADER_SIZE  ) != EPR_OK)
    {
        return STORAGE_ERROR;   // Read error  
    }

    // Is header code & usage ok?  
    else if (   g_storage_header.header_code != STORAGE_EEPROM_HEADER_CODE_MASK ||
                g_storage_header.usage       == 0)
    {       
        return STORAGE_NOT_FORMATTED;   // Not formatted  
    }
    // Is the usage = sum of all item?  
    else if (g_storage_header.usage != (    sizeof(g_storage_header)                +\
                                            g_storage_header.num_of_sys_state       +\
                                            g_storage_header.num_of_rtc_backup      +\
                                            g_storage_header.num_of_platform_info   +\
                                            g_storage_header.num_of_energy_log
                                             * sizeof(ONE_MONTH_ENERGY_DATA_LOG)    +\
                                            g_storage_header.num_of_tamper_log
                                             * sizeof(ONE_TAMPER_DATA_LOG)  )
            )
    {
        return STORAGE_NOT_FORMATTED;   // Not formatted   
    }

