Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/storage/meterdata/storage.c
    // Is indexing on energy log valid?  
    else if (   g_storage_header.num_of_energy_log > 0 &&
                g_storage_header.cur_energy_log_index >= g_storage_header.num_of_energy_log)
    {
        return STORAGE_NOT_FORMATTED;   // Not formatted  
    }
    // Is indexing on energy tamper log valid?  
    else if (   g_storage_header.num_of_tamper_log > 0 &&
                g_storage_header.cur_tamper_log_index >= g_storage_header.num_of_tamper_log)
    {
        return STORAGE_NOT_FORMATTED;   // Not formatted  
    }
    
    // Success  
    return STORAGE_OK;
}

/***********************************************************************************************************************
* Function Name    : static uint8_t STORAGE_UpdateEEPROMHeader(void)
* Description      : Update usage & g_storage_header to EEPROM Header
* Arguments        : None
* Functions Called : EPR_Write()
* Return Value     : Execution Status
*                  :    STORAGE_OK      Normal end, update success
*                  :    STORAGE_ERROR   Write error
***********************************************************************************************************************/
static uint8_t STORAGE_UpdateEEPROMHeader(void)
{
    //g_storage_header.header_code = STORAGE_EEPROM_HEADER_CODE_MASK;
    // Update usage  
    g_storage_header.usage = sizeof(g_storage_header)                   +\
                             g_storage_header.num_of_sys_state          +\
                             g_storage_header.num_of_rtc_backup         +\
                             g_storage_header.num_of_platform_info      +\
                             g_storage_header.num_of_energy_log
                              * sizeof(ONE_MONTH_ENERGY_DATA_LOG)       +\
                             g_storage_header.num_of_tamper_log
                              * sizeof(ONE_TAMPER_DATA_LOG) ;
    
    // Is write EEPROM OK?  
    if (EPR_Write(  STORAGE_EEPROM_HEADER_ADDR,
                    (uint8_t *)&g_storage_header,
                    STORAGE_EEPROM_HEADER_SIZE  ) != EPR_OK)
    {
        return STORAGE_ERROR;   // Write error  
    }
    
    // Success  
    return STORAGE_OK;
}

/***********************************************************************************************************************
* Function Name    : uint8_t STORAGE_Init(void)
* Description      : Storage Initialization
* Arguments        : None
* Functions Called : EPR_Init()
*                  : EPR_Read()
*                  : EPR_Write()
*                  : STORAGE_ReadEEPROMHeader()
* Return Value     : Execution Status
*                  :    STORAGE_OK      Normal end
*                  :    STORAGE_ERROR   Error occurred
*                  :                    Read/Write error or data validity error
***********************************************************************************************************************/
uint8_t STORAGE_Init(void)
{
    volatile uint32_t    header_code_test;
    volatile uint8_t     status;
    
    g_storage_state = STORAGE_STATE_UNINITIALIZED;  // Uninitialized  
    
    // EEPROM Driver Initialization  
    EPR_Init();	// This function clears g_is_send_end and g_is_receive_end flags
    
    // Read EEPROM header code for checking read  
    if (EPR_Read(   STORAGE_EEPROM_HEADER_HEADER_CODE_ADDR,
                    (uint8_t *)&g_storage_header.header_code,
                    STORAGE_EEPROM_HEADER_HEADER_CODE_SIZE  ) != EPR_OK)
    {
        return STORAGE_ERROR;   // Read error  
    }
    
    // write the header code test to check write  
    header_code_test = STORAGE_EEPROM_HEADER_CODE_TEST;	// write 4 bytes (int32) from address 0x0000 onwards 
    if (EPR_Write(  STORAGE_EEPROM_HEADER_HEADER_CODE_ADDR,
                    (uint8_t *)&header_code_test,
                    STORAGE_EEPROM_HEADER_HEADER_CODE_SIZE  ) != EPR_OK)
    {
        return STORAGE_ERROR;   // Write error  
    }
    
    // If write success, 
     // Re-read the header code on EEPROM and compare with STORAGE_EEPROM_HEADER_CODE_TEST
     // to check data validity  
    if (EPR_Read(   STORAGE_EEPROM_HEADER_HEADER_CODE_ADDR,
                    (uint8_t *)&header_code_test,
                    STORAGE_EEPROM_HEADER_HEADER_CODE_SIZE  ) != EPR_OK)
    {
        return STORAGE_ERROR;   // Read error  
    }
    // else is read ok, next check validity  
    else if (header_code_test != STORAGE_EEPROM_HEADER_CODE_TEST)
    {
        return STORAGE_ERROR;   // Data validity error  
    }

    // all check OK, restore header code from header_code 
    if (EPR_Write(  STORAGE_EEPROM_HEADER_HEADER_CODE_ADDR,
                    (uint8_t *)&g_storage_header.header_code,
                    STORAGE_EEPROM_HEADER_HEADER_CODE_SIZE  ) != EPR_OK)
    {
        return STORAGE_ERROR;   // Write error  
    }
    
    // Successful, at here STORAGE module is initial success  
    g_storage_state = STORAGE_STATE_INITIALIZED;    // Initialized  
    
    // Check data format  
    status = STORAGE_ReadEEPROMHeader();
    if (status == STORAGE_ERROR)
    {
        return STORAGE_ERROR;   // Error occurred when read EEPROM Header  
    }
    else if (status == STORAGE_NOT_FORMATTED)
    {
        return STORAGE_NOT_FORMATTED;   //  Storage data is not formatted  
    }

    return STORAGE_OK;  // OK, And storage is formatted  
}

/***********************************************************************************************************************
* Function Name    : uint8_t STORAGE_Format(void)
* Description      : Storage Format EEPROM Device to store data
* Arguments        : None
* Functions Called : EPR_Write()
* Return Value     : Execution Status
*                  :    STORAGE_OK          Formatted successfull, device is ready to store data
*                  :    STORAGE_ERROR       Storage device is not initialized
*                  :                        Or, error occurred when write data to EEPROM
***********************************************************************************************************************/
uint8_t STORAGE_Format(void)
{
    uint16_t    count;
    uint32_t    eeprom_addr;
    uint8_t     empty_page[STORAGE_EEPROM_PAGESIZE];
    
    STORAGE_EEPROM_HEADER formatted_header =
    {
        STORAGE_EEPROM_HEADER_CODE_MASK,    // Header Code (EM Formatted Header Code)   
        sizeof (STORAGE_EEPROM_HEADER),     // Usage (number of bytes)                  
        0,                                  // Number of EM System state bytes          
        0,                                  // Number of RTC Backup bytes               
        0,                                  // Number of EM Platform Information        
        0,                                  // Number of EM Energy Data Log Record      
        0,                                  // Number of EM Tamper Data Log Record      
        0,                                  // Current Energy Log Index                 
        0,                                  // Current Tamper Log Index                 
    };
    
    // Check storage state, only call when initial successfull  
    if (g_storage_state != STORAGE_STATE_INITIALIZED)
    {
        return STORAGE_ERROR;
    }
    
    // Create empty_page  
    for (count = 0; count < STORAGE_EEPROM_PAGESIZE; count++)
    {
        empty_page[count] = 0;
    }
    
