Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/storage/meterdata/storage.c
    // Clear Whole EEPROM  
    eeprom_addr = STORAGE_EEPROM_START_ADDR;
    while (eeprom_addr < STORAGE_EEPROM_SIZE)
    {
        if (EPR_Write(eeprom_addr, empty_page, STORAGE_EEPROM_PAGESIZE) != EPR_OK)
        {
            return STORAGE_ERROR;
        }
        
        eeprom_addr += STORAGE_EEPROM_PAGESIZE;
        
        R_WDT_Restart();
    }
    
    // Write initial EEPROM Header  
    if (EPR_Write(  STORAGE_EEPROM_HEADER_ADDR,
                    (uint8_t *)&formatted_header,
                    STORAGE_EEPROM_HEADER_SIZE  ) != EPR_OK)
    {
        return STORAGE_ERROR;
    }
    
    // Update current EEPROM header on RAM  
    g_storage_header = formatted_header;
    
    return STORAGE_OK;  // Formatted  
}

/***********************************************************************************************************************
* Function Name    : uint8_t STORAGE_Backup(uint8_t selection)
* Description      : Storage Backup (from EM Core to EEPROM)
* Note             : When STORAGE_ERROR is returned, maybe some data on selected item
*                  : (of [selection] parameter) have been stored to EEPROM
* Arguments        : uint8_t selection: Backup item selection
*                  :      STORAGE_ITEM_SYS_STATE    Select EM System State
*                  :      STORAGE_ITEM_RTC_TIME     Select RTC Time
*                  :      STORAGE_ITEM_ALL          Select all above items
* Functions Called : STORAGE_ReadEEPROMHeader()
*                  : EPR_Write()
*                  : EM_GetConfig()
*                  : EM_GetCalibInfo()
*                  : EM_GetState()
*                  : RTC_CounterGet()
*                  : STORAGE_UpdateEEPROMHeader()
* Return Value     : Execution Status
*                  :    STORAGE_OK      Backup successfull
*                  :    STORAGE_ERROR   Storage device is not initialized or not formatted
*                  :                    Or, error occurred when write EEPROM
*                  :                    Or, selection = 0 (STORAGE_ITEM_NONE)
***********************************************************************************************************************/
uint8_t STORAGE_Backup(uint8_t selection)
{
    uint8_t                 status;
    
    // Check parameter  
    if (selection == STORAGE_ITEM_NONE)
    {
        return STORAGE_ERROR;   // Params error  
    }
    
    // Check Storage State  
    if (g_storage_state != STORAGE_STATE_INITIALIZED)
    {
        return STORAGE_ERROR;   // Device is not initialized  
    }
    
    // Get EEPROM Header  
    if (STORAGE_ReadEEPROMHeader() != STORAGE_OK)
    {
        return STORAGE_ERROR;   // EEPROM Header error (not formatted)  
    }
    
    // Is STORAGE_ITEM_SYS_STATE selected?  
    if ((selection & STORAGE_ITEM_SYS_STATE) != 0)
    {
        uint32_t eeprom_addr;
        uint16_t statesize, copied_size;    
        uint8_t  page_buffer[STORAGE_EEPROM_PAGESIZE];
    
        eeprom_addr = STORAGE_EEPROM_SYSTEM_STATE_ADDR; // Point to EEPROM System State Location  
        copied_size = 0;
        statesize   = 0;
        
        // Start backup the system state  
        do
        {
            // Get 1 page of the state  
            status = EM_GetState(page_buffer, STORAGE_EEPROM_PAGESIZE, &statesize);
            
            // Is end of copy?  
            if (status == EM_OK)
            {
                // Write the remain buffer (statesize - copied_size) to EEPROM  
                if (EPR_Write(eeprom_addr, page_buffer, statesize - copied_size) != EPR_OK)
                {
                    return STORAGE_ERROR;   // Write error  
                }
                
                copied_size = statesize;    // Backup all  
            }
            // Is still copying?  
            else if (status == EM_COPYING)
            {
                // Write 1 page to EEPROM  
                if (EPR_Write(eeprom_addr, page_buffer, STORAGE_EEPROM_PAGESIZE) != EPR_OK)
                {
                    return STORAGE_ERROR;   // Write error  
                }
                
                // Start copy next page  
                eeprom_addr += STORAGE_EEPROM_PAGESIZE;
                copied_size += STORAGE_EEPROM_PAGESIZE;
            }
            else    // Error occurred on Get State of EM Core  
            {
                return STORAGE_ERROR;       // EM Core Get State error  
            }           

        }
        // Only loop when still copying &
         // total copied byte not exceed max buffer size for System State  
        while (status == EM_COPYING && copied_size < STORAGE_EEPROM_SYSTEM_STATE_SIZE);
        
        // Update number used bytes of system state to storage header  
        g_storage_header.num_of_sys_state = statesize;
    }

    // Is STORAGE_ITEM_RTC_TIME selected?  
    if ((selection & STORAGE_ITEM_RTC_TIME) != 0)
    {
        uint16_t                        timeout;    
        rtc_calendarcounter_value_t     rtctime;
        RTC_DATE_TIME                   eeprom_rtctime;
    
        // Get RTC Time  
        R_RTC_Get_CalendarCounterValue(&rtctime);
        status = MD_OK;
        
        // end of getting RTC time (timeout is over),
         // but still not success,
         // break processing here with error status  
        if (status != MD_OK)
        {
            return STORAGE_ERROR;   // Can't get RTC time  
        }
        
        eeprom_rtctime.Sec      = rtctime.rseccnt   ;
        eeprom_rtctime.Min      = rtctime.rmincnt   ;
        eeprom_rtctime.Hour     = rtctime.rhrcnt    ;
        eeprom_rtctime.Day      = rtctime.rdaycnt   ;
        eeprom_rtctime.Week     = rtctime.rwkcnt    ;
        eeprom_rtctime.Month    = rtctime.rmoncnt   ;
        eeprom_rtctime.Year     = (uint8_t)rtctime.ryrcnt    ;
        eeprom_rtctime.reserved = 0             ;
        
        // Store to EEPROM  
        if (EPR_Write(  STORAGE_EEPROM_RTC_TIME_BACKUP_ADDR,
                        (uint8_t *)&eeprom_rtctime,
                        STORAGE_EEPROM_RTC_TIME_BACKUP_SIZE ) != EPR_OK)
        {
            return STORAGE_ERROR;
        }
        
