Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/storage/meterdata/storage.c
        // Update number used bytes of RTC backup to storage header  
        g_storage_header.num_of_rtc_backup = STORAGE_EEPROM_RTC_TIME_BACKUP_SIZE;
    }

    // Update EEPROM Header  
    if (STORAGE_UpdateEEPROMHeader() != STORAGE_OK)
    {
        return STORAGE_ERROR;   // Write error  
    }
    
    // Success  
    return STORAGE_OK;
}

/***********************************************************************************************************************
* Function Name    : uint8_t STORAGE_Restore(uint8_t selection)
* Description      : Storage Restore (from EEPROM to EM Core)
* Arguments        : uint8_t selection: Restore item selection
*                  :      STORAGE_ITEM_SYS_STATE    Select EM System State
*                  :      STORAGE_ITEM_RTC_TIME     Select RTC Time
*                  :      STORAGE_ITEM_ALL          Select all above items
* Functions Called : STORAGE_ReadEEPROMHeader()
*                  : EPR_Read()
*                  : EM_SetConfig()
*                  : EM_SetCalibInfo()
*                  : EM_SetState()
*                  : RTC_CounterSet()
* Return Value     : Execution Status
*                  :    STORAGE_OK                  Restore successfull
*                  :    STORAGE_ERROR_DATA_CORRUPT  Related data on EEPROM of selected item is corrupt
*                  :    STORAGE_ERROR               Storage device is not initialized or not formatted
*                  :                                Or, error occurred when read EEPROM,
*                  :                                Or, selection = 0 (STORAGE_ITEM_NONE)
***********************************************************************************************************************/
uint8_t STORAGE_Restore(uint8_t selection)
{
    uint8_t                 status;
    
    // Check parameter  
    if (selection == STORAGE_ITEM_NONE)
    {
        return STORAGE_ERROR;   // Params error  
    }
    
    // Check Storage State  
    if (g_storage_state != STORAGE_STATE_INITIALIZED)
    {
        return STORAGE_ERROR;   // Device is not initialized  
    }
    
    // Get EEPROM Header  
    if (STORAGE_ReadEEPROMHeader() != STORAGE_OK)
    {
        return STORAGE_ERROR;   // EEPROM Header error  
    }
    
    // Is STORAGE_ITEM_SYS_STATE selected?  
    if ((selection & STORAGE_ITEM_SYS_STATE) != 0)
    {
        // Is EM System State data valid in EEPROM?  
        if (g_storage_header.num_of_sys_state > 0 &&
            g_storage_header.num_of_sys_state <= STORAGE_EEPROM_SYSTEM_STATE_SIZE)
        {
            uint32_t    eeprom_addr;
            uint16_t    statesize, page_size;   
            uint8_t     page_buffer[STORAGE_EEPROM_PAGESIZE];
    
            eeprom_addr = STORAGE_EEPROM_SYSTEM_STATE_ADDR;         // Point to EEPROM System State Location  
            statesize   = g_storage_header.num_of_sys_state;        // Get number of system state  
            
            // Start backup the system state  
            do
            {
                // Is system state still >= 1 page?  
                if (statesize >= STORAGE_EEPROM_PAGESIZE)
                {
                    page_size = STORAGE_EEPROM_PAGESIZE;
                }
                else
                {
                    page_size = statesize;
                }
            
                // Read system state buffer from EEPROM  
                if (EPR_Read(eeprom_addr, page_buffer, page_size) != EPR_OK)
                {
                    return STORAGE_ERROR;   // Read error  
                }

                // Set to EM Core
                //  In case of EM_OK is returned
                //  the loop will break, END of processing
                //  Else, system state need more than 1 page
                
                status = EM_SetState(page_buffer, page_size, g_storage_header.num_of_sys_state);
                
                // Is still copying?  
                if (status == EM_COPYING)
                {
                    // Point to next page  
                    statesize   -= page_size;               
                    eeprom_addr += page_size;
                }
                // Not OK?  
                else if (status != EM_OK)
                {
                    return STORAGE_ERROR_DATA_CORRUPT;  // Data corrupt  
                }

            }
            // Only loop when still copying & still remain state buffer  
            while (status == EM_COPYING && statesize > 0);
        }
    }

    // Is STORAGE_ITEM_RTC_TIME selected?  
    if ((selection & STORAGE_ITEM_RTC_TIME) != 0)
    {
        // Is RTC Backup data valid in EEPROM?  
        if (g_storage_header.num_of_rtc_backup == STORAGE_EEPROM_RTC_TIME_BACKUP_SIZE)
        {
            uint16_t                        timeout;    
            rtc_calendarcounter_value_t     rtctime;
            RTC_DATE_TIME                   eeprom_rtctime;
    
            // Get RTC Backup from EEPROM  
            if (EPR_Read(   STORAGE_EEPROM_RTC_TIME_BACKUP_ADDR,
                            (uint8_t *)&eeprom_rtctime,
                            STORAGE_EEPROM_RTC_TIME_BACKUP_SIZE ) != EPR_OK)
            {
                return STORAGE_ERROR;   // Read error  
            }
            
            rtctime.rseccnt = eeprom_rtctime.Sec   ;
            rtctime.rmincnt = eeprom_rtctime.Min   ;
            rtctime.rhrcnt  = eeprom_rtctime.Hour  ;
            rtctime.rdaycnt = eeprom_rtctime.Day   ;
            rtctime.rwkcnt  = eeprom_rtctime.Week  ;
            rtctime.rmoncnt = eeprom_rtctime.Month ;
            rtctime.ryrcnt  = eeprom_rtctime.Year  ;
            
            // Set RTC Time  
            R_RTC_Set_CalendarCounterValue(rtctime);
            status = MD_OK;
            
            // end of setting RTC time (time is over),
            // but still not success,
            // break processing here with error status  
            if (status != MD_OK)
            {
                return STORAGE_ERROR;   // Can't set RTC time  
            }
        }
    }
    
    // Success  
    return STORAGE_OK;
}

