Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/storage/meterdata/storage.c
/***********************************************************************************************************************
* Function Name    : uint8_t STORAGE_ReadPlatformInfo(PLATFORM_INFO *p_platform_info)
* Description      : Storage Read Platform Information
* Arguments        : PLATFORM_INFO *p_platform_info: Buffer to store the platform info
* Functions Called : STORAGE_ReadEEPROMHeader()
*                  : EPR_Read()
* Return Value     : Execution Status
*                  :    STORAGE_OK      Read successfull
*                  :    STORAGE_ERROR   Error occurred, NULL parameter
*                  :                    Or, Storage device is not initialized or not formatted, or R/W error
***********************************************************************************************************************/
uint8_t STORAGE_ReadPlatformInfo(PLATFORM_INFO *p_platform_info)
{
    // Check parameter  
    if (p_platform_info == NULL)
    {
        return STORAGE_ERROR;   // Params error  
    }
    
    // Check Storage State  
    if (g_storage_state != STORAGE_STATE_INITIALIZED)
    {
        return STORAGE_ERROR;   // Device is not initialized  
    }

/*
// check this out is it necessary
    // Read & Check eeprom header  
    if (STORAGE_ReadEEPROMHeader() != STORAGE_OK)
    {
        return STORAGE_ERROR;   // Header error  
    }
*/    
    // Read platform info block  
    if (EPR_Read(   STORAGE_EEPROM_PLATFORM_INFO_ADDR,
                    (uint8_t *)p_platform_info,
                    STORAGE_EEPROM_PLATFORM_INFO_SIZE   ) != EPR_OK )
    {
        return STORAGE_ERROR;   // Read error  
    }
    
    return STORAGE_OK;
}

/***********************************************************************************************************************
* Function Name    : uint8_t STORAGE_WritePlatformInfo(PLATFORM_INFO *p_platform_info)
* Description      : Storage Write Platform Information
* Arguments        : PLATFORM_INFO *p_platform_info: Buffer of the platform info wanted to write
* Functions Called : STORAGE_ReadEEPROMHeader()
*                  : EPR_Write()
*                  : STORAGE_UpdateEEPROMHeader()
* Return Value     : Execution Status
*                  :    STORAGE_OK      Write successfull
*                  :    STORAGE_ERROR   Error occurred, NULL parameter
*                  :                    Or, Storage device is not initialized or not formatted, or R/W error
**********************************************************************************************************************/
uint8_t STORAGE_WritePlatformInfo(PLATFORM_INFO *p_platform_info)
{
    // Check parameter  
    if (p_platform_info == NULL)
    {
        return STORAGE_ERROR;   // Params error  
    }
    
    // Check Storage State  
    if (g_storage_state != STORAGE_STATE_INITIALIZED)
    {
        return STORAGE_ERROR;   // Device is not initialized  
    }
    
    // Read & Check eeprom header  
    if (STORAGE_ReadEEPROMHeader() != STORAGE_OK)
    {
        return STORAGE_ERROR;   // Header error  
    }
    
    // Write platform info block  
    if (EPR_Write(  STORAGE_EEPROM_PLATFORM_INFO_ADDR,
                    (uint8_t *)p_platform_info,
                    STORAGE_EEPROM_PLATFORM_INFO_SIZE   ) != EPR_OK )
    {
        return STORAGE_ERROR;   // Write error  
    }
    
    // Update usage on EEPROM  
    g_storage_header.num_of_platform_info = STORAGE_EEPROM_PLATFORM_INFO_SIZE;
    
    // Update eeprom header  
    if (STORAGE_UpdateEEPROMHeader() != STORAGE_OK)
    {
        return STORAGE_ERROR;   // Write header error  
    }
    
    // Success  
    return STORAGE_OK;
}

/***********************************************************************************************************************
* Function Name    : uint8_t STORAGE_AddEnergyLog(ONE_MONTH_ENERGY_DATA_LOG *p_energy_log)
* Description      : Storage Add Energy Log Record
* Arguments        : ONE_MONTH_ENERGY_DATA_LOG *p_energy_log: Buffer of a energy log record
* Functions Called : STORAGE_ReadEEPROMHeader()
*                  : EPR_Write()
*                  : STORAGE_UpdateEEPROMHeader()
* Return Value     : Execution Status
*                  :    STORAGE_OK      Add successfull
*                  :    STORAGE_ERROR   Error occurred, NULL parameter
*                  :                    Or, Storage device is not initialized or not formatted, or R/W error
***********************************************************************************************************************/
uint8_t STORAGE_AddEnergyLog(ONE_MONTH_ENERGY_DATA_LOG *p_energy_log)
{
/*
    uint32_t    eeprom_addr;
    
    // Check parameter  
    if (p_energy_log == NULL)
    {
        return STORAGE_ERROR;   // Params error  
    }
    
    // Check Storage State  
    if (g_storage_state != STORAGE_STATE_INITIALIZED)
    {
        return STORAGE_ERROR;   // Device is not initialized  
    }
    
    // Read & Check eeprom header  
    if (STORAGE_ReadEEPROMHeader() != STORAGE_OK)
    {
        return STORAGE_ERROR;   // Header error  
    }
    
    // Point to the next element on the array of energy log
    // Update num_of_energy_log & cur_energy_log_index  
    if (g_storage_header.num_of_energy_log == 0)        // Fist time of logging?  
    {
        g_storage_header.num_of_energy_log    = 1;
        g_storage_header.cur_energy_log_index = 0;
    }
    else    // logging than 1 times  
    {
        // is array not full?  
        if (g_storage_header.num_of_energy_log * sizeof(ONE_MONTH_ENERGY_DATA_LOG) < STORAGE_EEPROM_ENERGY_DATA_LOG_SIZE)
        {
            g_storage_header.num_of_energy_log++;
        }
        
        // when num_of_energy_log reached to max (12 months)
        // the g_storage_header.cur_energy_log_index will roll over  
        g_storage_header.cur_energy_log_index++;
        g_storage_header.cur_energy_log_index %= (STORAGE_EEPROM_ENERGY_DATA_LOG_SIZE / sizeof(ONE_MONTH_ENERGY_DATA_LOG));
    }
    
    // Point to element on energy data log array  
    eeprom_addr  = STORAGE_EEPROM_ENERGY_DATA_LOG_ADDR;                                         // Point to ahead of array  
    eeprom_addr += g_storage_header.cur_energy_log_index * sizeof(ONE_MONTH_ENERGY_DATA_LOG);   // Add offset  

