Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/storage/meterdata/storage.c
    // Write record  
    if (EPR_Write(  eeprom_addr,
                    (uint8_t *)p_energy_log,
                    sizeof(ONE_MONTH_ENERGY_DATA_LOG)   ) != EPR_OK )
    {
        return STORAGE_ERROR;   // Write error  
    }

    // Update eeprom header  
    if (STORAGE_UpdateEEPROMHeader() != STORAGE_OK)
    {
        return STORAGE_ERROR;   // Header error  
    }
*/    
    // Success  
    return STORAGE_OK;
}

/**********************************************************************************************************************
* Function Name    : uint8_t STORAGE_AddTamperLog(ONE_TAMPER_DATA_LOG *p_tamper_log)
* Description      : Storage Add Tamper Log record
* Arguments        : ONE_TAMPER_DATA_LOG *p_tamper_log: Buffer of a tamper log record wanted to write
* Functions Called : STORAGE_ReadEEPROMHeader()
*                  : EPR_Write()
*                  : STORAGE_UpdateEEPROMHeader()
* Return Value     : Execution Status
*                  :    STORAGE_OK      Add successfull
*                  :    STORAGE_ERROR   Error occurred, NULL parameter
*                  :                    Or, Storage device is not initialized or not formatted, or R/W error
***********************************************************************************************************************/
uint8_t STORAGE_AddTamperLog(ONE_TAMPER_DATA_LOG *p_tamper_log)
{
/*	
    uint32_t    eeprom_addr;
    
    // Check parameter  
    if (p_tamper_log == NULL)
    {
        return STORAGE_ERROR;   // Params error  
    }
    
    // Check Storage State  
    if (g_storage_state != STORAGE_STATE_INITIALIZED)
    {
        return STORAGE_ERROR;   // Device is not initialized  
    }
    
    // Read & Check eeprom header  
    if (STORAGE_ReadEEPROMHeader() != STORAGE_OK)
    {
        return STORAGE_ERROR;   // Header error  
    }
    
    // Point to the next element on the array of tamper log
    // Update num_of_tamper_log & cur_tamper_log_index  
    if (g_storage_header.num_of_tamper_log == 0)        // Fist time of logging?  
    {
        g_storage_header.num_of_tamper_log    = 1;
        g_storage_header.cur_tamper_log_index = 0;
    }
    else    // logging than 1 times  
    {
        // is array not full?  
        if (g_storage_header.num_of_tamper_log * sizeof(ONE_TAMPER_DATA_LOG) < STORAGE_EEPROM_TAMPER_DATA_LOG_SIZE)
        {
            g_storage_header.num_of_tamper_log++;
        }
        
        // when num_of_tamper_log reached to max (200 events)
        // the g_storage_header.cur_tamper_log_index will roll over  
        g_storage_header.cur_tamper_log_index++;
        g_storage_header.cur_tamper_log_index %= STORAGE_EEPROM_TAMPER_DATA_LOG_SIZE / sizeof(ONE_TAMPER_DATA_LOG);
    }
    
    // Point to element on tamper data log array  
    eeprom_addr  = STORAGE_EEPROM_TAMPER_DATA_LOG_ADDR;                                     // Point to head  
    eeprom_addr += g_storage_header.cur_tamper_log_index * sizeof(ONE_TAMPER_DATA_LOG);     // Add offset  

    // Write record  
    if (EPR_Write(  eeprom_addr,
                    (uint8_t *)p_tamper_log,
                    sizeof(ONE_TAMPER_DATA_LOG) ) != EPR_OK )
    {
        return STORAGE_ERROR;   // Write error  
    }

    // Update eeprom header  
    if (STORAGE_UpdateEEPROMHeader() != STORAGE_OK)
    {
        return STORAGE_ERROR;   // Header error  
    }
*/    
    // Success  
    return STORAGE_OK;
}

/***********************************************************************************************************************
* Function Name    : uint8_t STORAGE_GetEnergyLog(ONE_MONTH_ENERGY_DATA_LOG *p_energy_log)
* Description      : Storage Add Energy Log Record
* Arguments        : ONE_MONTH_ENERGY_DATA_LOG *p_energy_log: Buffer of a energy log record
* Functions Called : STORAGE_ReadEEPROMHeader()
*                  : EPR_Write()
*                  : STORAGE_UpdateEEPROMHeader()
* Return Value     : Execution Status
*                  :    STORAGE_OK      Add successfull
*                  :    STORAGE_ERROR   Error occurred, NULL parameter
*                  :                    Or, Storage device is not initialized or not formatted, or R/W error
***********************************************************************************************************************/
uint8_t STORAGE_GetEnergyLog(ONE_MONTH_ENERGY_DATA_LOG *p_energy_log)
{
/*
    uint8_t                     i, number_tariff;
    rtc_calendarcounter_value_t rtctime;        // RTC data 
    ONE_MONTH_ENERGY_DATA_LOG   energy_log;
    
    R_RTC_Get_CalendarCounterValue(&rtctime);
    
    // zero all bytes of energy_log buffer  
    memset((uint8_t *)&energy_log, 0, sizeof(ONE_MONTH_ENERGY_DATA_LOG));
    
    // Log RTC time to energy log  
    energy_log.present_rtc_log.Sec   = rtctime.rseccnt;
    energy_log.present_rtc_log.Min   = rtctime.rmincnt;
    energy_log.present_rtc_log.Hour  = rtctime.rhrcnt;
    energy_log.present_rtc_log.Day   = rtctime.rdaycnt;
    energy_log.present_rtc_log.Week  = rtctime.rwkcnt;
    energy_log.present_rtc_log.Month = rtctime.rmoncnt;
    energy_log.present_rtc_log.Year  = (uint8_t)(rtctime.ryrcnt);
    
    // Log max demand  
    energy_log.phase_r.present_max_demand.active   = EM_GetActiveMaxDemand(LINE_PHASE_R);
    energy_log.phase_r.present_max_demand.reactive = EM_GetReactiveMaxDemand(LINE_PHASE_R);
    energy_log.phase_r.present_max_demand.apparent = EM_GetApparentMaxDemand(LINE_PHASE_R);
    
    energy_log.phase_y.present_max_demand.active   = EM_GetActiveMaxDemand(LINE_PHASE_Y);
    energy_log.phase_y.present_max_demand.reactive = EM_GetReactiveMaxDemand(LINE_PHASE_Y);
    energy_log.phase_y.present_max_demand.apparent = EM_GetApparentMaxDemand(LINE_PHASE_Y);
    
    energy_log.phase_b.present_max_demand.active   = EM_GetActiveMaxDemand(LINE_PHASE_B);
    energy_log.phase_b.present_max_demand.reactive = EM_GetReactiveMaxDemand(LINE_PHASE_B);
    energy_log.phase_b.present_max_demand.apparent = EM_GetApparentMaxDemand(LINE_PHASE_B);
    
    energy_log.total.present_max_demand.active   =      energy_log.phase_r.present_max_demand.active +
                                                        energy_log.phase_y.present_max_demand.active +
                                                        energy_log.phase_b.present_max_demand.active;
                                                    
