Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/storage/meterdata/storage.c
    energy_log.total.present_max_demand.reactive   =    energy_log.phase_r.present_max_demand.reactive +
                                                        energy_log.phase_y.present_max_demand.reactive +
                                                        energy_log.phase_b.present_max_demand.reactive;
                                                    
    energy_log.total.present_max_demand.apparent   =    energy_log.phase_r.present_max_demand.apparent +
                                                        energy_log.phase_y.present_max_demand.apparent +
                                                        energy_log.phase_b.present_max_demand.apparent;
    
    EM_ResetMaxDemand(SRC_ALL, LINE_PHASE_R);       // Clear Max Demand Value for next month accumulate  
    EM_ResetMaxDemand(SRC_ALL, LINE_PHASE_Y);       // Clear Max Demand Value for next month accumulate  
    EM_ResetMaxDemand(SRC_ALL, LINE_PHASE_B);       // Clear Max Demand Value for next month accumulate  
    
    // Log energy total tariff  
    energy_log.phase_r.present_energy_total_tariff.active   = EM_GetActiveEnergyTotal(LINE_PHASE_R);
    energy_log.phase_r.present_energy_total_tariff.reactive = EM_GetReactiveEnergyTotal(LINE_PHASE_R);
    energy_log.phase_r.present_energy_total_tariff.apparent = EM_GetApparentEnergyTotal(LINE_PHASE_R);
                                                       
    energy_log.phase_y.present_energy_total_tariff.active   = EM_GetActiveEnergyTotal(LINE_PHASE_Y);
    energy_log.phase_y.present_energy_total_tariff.reactive = EM_GetReactiveEnergyTotal(LINE_PHASE_Y);
    energy_log.phase_y.present_energy_total_tariff.apparent = EM_GetApparentEnergyTotal(LINE_PHASE_Y);
    
    energy_log.phase_b.present_energy_total_tariff.active   = EM_GetActiveEnergyTotal(LINE_PHASE_B);
    energy_log.phase_b.present_energy_total_tariff.reactive = EM_GetReactiveEnergyTotal(LINE_PHASE_B);
    energy_log.phase_b.present_energy_total_tariff.apparent = EM_GetApparentEnergyTotal(LINE_PHASE_B);
    
    energy_log.total.present_energy_total_tariff.active   =     energy_log.phase_r.present_energy_total_tariff.active +
                                                                energy_log.phase_y.present_energy_total_tariff.active +
                                                                energy_log.phase_b.present_energy_total_tariff.active;
                                                            
    energy_log.total.present_energy_total_tariff.reactive   =   energy_log.phase_r.present_energy_total_tariff.reactive +
                                                                energy_log.phase_y.present_energy_total_tariff.reactive +
                                                                energy_log.phase_b.present_energy_total_tariff.reactive;
                                                            
    energy_log.total.present_energy_total_tariff.apparent   =   energy_log.phase_r.present_energy_total_tariff.apparent +
                                                                energy_log.phase_y.present_energy_total_tariff.apparent +
                                                                energy_log.phase_b.present_energy_total_tariff.apparent;
    
    // Log Energy Tariff  
    number_tariff = EM_GetConfig().number_tariff;
    for (i = 0; i < number_tariff; i++)
    {
        // Phase_R  
        EM_GetActiveEnergyTariff(i, &energy_log.phase_r.present_energy_tariff[i].active, LINE_PHASE_R);
        EM_GetReactiveEnergyTariff(i, &energy_log.phase_r.present_energy_tariff[i].reactive, LINE_PHASE_R);
        EM_GetApparentEnergyTariff(i, &energy_log.phase_r.present_energy_tariff[i].apparent, LINE_PHASE_R);
        
        // Phase_Y  
        EM_GetActiveEnergyTariff(i, &energy_log.phase_y.present_energy_tariff[i].active, LINE_PHASE_Y);
        EM_GetReactiveEnergyTariff(i, &energy_log.phase_y.present_energy_tariff[i].reactive, LINE_PHASE_Y);
        EM_GetApparentEnergyTariff(i, &energy_log.phase_y.present_energy_tariff[i].apparent, LINE_PHASE_Y);
        
        // Phase_B  
        EM_GetActiveEnergyTariff(i, &energy_log.phase_b.present_energy_tariff[i].active, LINE_PHASE_B);
        EM_GetReactiveEnergyTariff(i, &energy_log.phase_b.present_energy_tariff[i].reactive, LINE_PHASE_B);
        EM_GetApparentEnergyTariff(i, &energy_log.phase_b.present_energy_tariff[i].apparent, LINE_PHASE_B);
        
        energy_log.total.present_energy_tariff[i].active    =   energy_log.phase_r.present_energy_tariff[i].active + 
                                                                energy_log.phase_y.present_energy_tariff[i].active +
                                                                energy_log.phase_b.present_energy_tariff[i].active;
                                                                
        energy_log.total.present_energy_tariff[i].reactive  =   energy_log.phase_r.present_energy_tariff[i].reactive + 
                                                                energy_log.phase_y.present_energy_tariff[i].reactive +
                                                                energy_log.phase_b.present_energy_tariff[i].reactive;
                                                                
        energy_log.total.present_energy_tariff[i].apparent  =   energy_log.phase_r.present_energy_tariff[i].apparent + 
                                                                energy_log.phase_y.present_energy_tariff[i].apparent +
                                                                energy_log.phase_b.present_energy_tariff[i].apparent;
        
    }
    
    // Assign the pointer to acquired value  
    *p_energy_log = energy_log;
*/    
    // Success  
    return STORAGE_OK;
}

/***********************************************************************************************************************
* Function Name    : uint8_t STORAGE_GetTamperLog(ONE_TAMPER_DATA_LOG *p_tamper_log)
* Description      : Storage Add Energy Log Record
* Arguments        : ONE_MONTH_ENERGY_DATA_LOG *p_energy_log: Buffer of a energy log record
* Functions Called : STORAGE_ReadEEPROMHeader()
*                  : EPR_Write()
*                  : STORAGE_UpdateEEPROMHeader()
* Return Value     : Execution Status
*                  :    STORAGE_OK      Add successfull
*                  :    STORAGE_ERROR   Error occurred, NULL parameter
*                  :                    Or, Storage device is not initialized or not formatted, or R/W error
***********************************************************************************************************************/
uint8_t STORAGE_GetTamperLog(ONE_TAMPER_DATA_LOG *p_tamper_log)
{
/*	
    rtc_calendarcounter_value_t rtctime;        // RTC data  
    // For Tamper event  
    EM_STATUS                   em_status;      // EM Status  
    ONE_TAMPER_DATA_LOG         tamper_log;
    
    R_RTC_Get_CalendarCounterValue(&rtctime);

    // zero all bytes of tamper_log buffer  
    memset((uint8_t *)&tamper_log, 0, sizeof(ONE_TAMPER_DATA_LOG));

    // Update RTC time to tamper event  
    tamper_log.tamper_rtc_time.Sec   = rtctime.rseccnt;
    tamper_log.tamper_rtc_time.Min   = rtctime.rmincnt;
    tamper_log.tamper_rtc_time.Hour  = rtctime.rhrcnt;
    tamper_log.tamper_rtc_time.Day   = rtctime.rdaycnt;
    tamper_log.tamper_rtc_time.Week  = rtctime.rwkcnt;
    tamper_log.tamper_rtc_time.Month = rtctime.rmoncnt;
    tamper_log.tamper_rtc_time.Year  = (uint8_t)rtctime.ryrcnt;
    
    // Update tamper status to tamper event  
    em_status = EM_GetStatus();
    tamper_log.tamper_type.details.is_neutral_missing        = em_status.tampers.details.is_neutral_missing;
    tamper_log.tamper_type.details.is_missing_potential_R    = em_status.tampers.details.is_missing_potential_R;
    tamper_log.tamper_type.details.is_missing_potential_Y    = em_status.tampers.details.is_missing_potential_Y;
    tamper_log.tamper_type.details.is_missing_potential_B    = em_status.tampers.details.is_missing_potential_B;
    tamper_log.tamper_type.details.is_voltage_unbalance      = em_status.tampers.details.is_voltage_unbalance;
    tamper_log.tamper_type.details.is_reverse_current_R      = em_status.tampers.details.is_reverse_current_R;
    tamper_log.tamper_type.details.is_reverse_current_Y      = em_status.tampers.details.is_reverse_current_Y;
    tamper_log.tamper_type.details.is_reverse_current_B      = em_status.tampers.details.is_reverse_current_B;
    tamper_log.tamper_type.details.is_open_current_R         = em_status.tampers.details.is_open_current_R;
    tamper_log.tamper_type.details.is_open_current_Y         = em_status.tampers.details.is_open_current_Y;
    tamper_log.tamper_type.details.is_open_current_B         = em_status.tampers.details.is_open_current_B;
    tamper_log.tamper_type.details.is_current_unbalance      = em_status.tampers.details.is_current_unbalance;
    tamper_log.tamper_type.details.is_current_bypass         = em_status.tampers.details.is_current_bypass;

    tamper_log.tamper_type.details.case_open                 = EVENT_IsCaseOpen();
    tamper_log.tamper_type.details.magnet                    = EVENT_IsMagnet();
    
		tamper_log.tamper_type.details.power_failed              = EVENT_IsPowerFail();
    
    // Assign the pointer to acquired value  
    p_tamper_log->tamper_rtc_time = tamper_log.tamper_rtc_time;
    p_tamper_log->tamper_type.value = tamper_log.tamper_type.value;
*/    
    // Success  
    return STORAGE_OK;
}
